BenchBnB/app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params);
        if @user.save
---
INSERT INTO "users" ("session_token", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["session_token", "kVVpe67cYj9jfPsbYpFmNw"], ["created_at", "2021-01-13 21:35:45.872004"], ["updated_at", "2021-01-13 21:35:45.872004"]]